<!-- 
ตัวดำเนินการเพิ่มค่า - ลดค่า
++(Prefix) ++a เพิ่มค่าให้ a ก่อน 1 ค่าแล้วนําไปใช้
++(Postfix) a++ นําค่าปัจจุบันใน a ไปใช้ก่อนแล้วค่อยเพิ่มค่า

--(Prefix)  --b ลดค่าให้ b ก่อน 1 ค่าแล้วนําไปใช้
--(Postfix) b-- นําค่าปัจจุบันใน b ไปใช้ก่อนแล้ว
ค่อยลดค่า
-->
<?php
$a=5;
$b=10;
/* เพิ่มค่า*/
echo "ค่าเริ่มต้น = ".$a."<br>"; // 5
echo "เพิ่มค่าแบบ prefix= ".(++$a)."<br>";
echo "ค่าล่าสุดของ a = ".$a;

echo "<hr>";
$a=5;
echo "ค่าเริ่มต้น = ".$a."<br>"; // 5
echo "เพิ่มค่าแบบ postfix = ".($a++). "<br>";
echo "ค่าล่าสุดของ a = ".$a;

echo "<hr>";
/* ลดค่า*/
echo "ค่าเริ่มต้น = ".$b."<br>"; // 10
echo "ลดค่าแบบ prefix= ".(--$b)."<br>";
echo "ค่าล่าสุดของ b = ".$b;

echo "<hr>";
$b=10;
echo "ค่าเริ่มต้น = ".$b."<br>"; // 10
echo "ลดค่าแบบ postfix = ".($b--). "<br>";
echo "ค่าล่าสุดของ b = ".$b;
?>