<!-- 
    โครงสร้างตัวแปร
    $ชื่อตัวแปร = ค่าของตัวแปร

    กฎการตั้งชื่อตัวแปร
1. สามารถเป็นได้ทั้งตัวอักษร ตัวเลข สัญลักษณ์ _(underscores) และ $(dollar sign)
2. อักษรตัวแรกห้ามเป็นตัวเลข
3. Case Sensitive ตัวพิมพ์เล็ก พิมพ์ใหญ่ มีความหมายต่างกัน
4. ไม่ซ้ำกับ built-in function (ฟังก์ชั่นมาตรฐานใน PHP)
5. ตัวแปรขึ้นต้นด้วย $(dollar sign)
6. ตัวแปรไม่สามารถเว้นว่าง หรือเคาะเว้นวรรคได้
-->
<?php
$name = "somsri"; //ข้อความ
$age = 21;
echo "ชื่อ = " .$name. "<br>";
// echo "<br>"; ทำแบบนี้เว้นบรรทัดก็ได้
echo "อายุ =" .$age. "<br>";
// echo $age+20. "<br>";
$total =500;
$Total = 1000;
echo "ผลรวม =" .$total."<br>";
echo $Total."<br>";
// ตัวอักษรตัวใหญ๋ตัวเล็กมีค่าต่างกัน
$year = $age;
echo "ชื่อ =".$name."<br>";
echo "อายุ =".$age."<br>";
?>